<!DOCTYPE html>
<html>



<head>
	<meta charset="utf-8">
	<title>Практика по первому уроку</title>
</head>
<body>



<a href="http://localhost/theory1.php">Ссылка на страничку теории
	<img src="http://localhost/img/pointer-back.png"></a>



<h1>Задачи на работу с основными HTML тегами и атрибутами</h1>
	<h2>1. Задачи на заголовки, жирность, курсив</h2>
		<h2>Это заголовок h2</h2>
		<h3>Это заголовок h3</h3>
		<h4>Это заголовок h4</h4>	
		<h5>Это заголовок h5</h5>
		<p>Это Абзац с <b>жирным текстом</b></p></p>
		<p>Это еще Абзац с <i>курсивом</i></p>
		<h1><i>Это заголовок h1 курсивом </i></h1>



	<h2>1.2.Повторите страницу по данному образцу: </h2>
		<img src="http://localhost/img/example1.jpg">
		<p>Решение:</p>
		<h1>Что такое Сms</h1>
			<p><b>CMS</b> - &laquoсистема управления контентом&raquo <b>(Движок)</b> - написанная PHP-программистами основа для сайта, с помощью которой вы сможете упрвлять сайтом (добавлять контент, менять пункты меню и т.п.) не зная HTML и CSS.</p>
			<p>Однако, для того чтобы сделать сайт с помощью <b>CMS</b> <i>потребуются услуги</i> и программиста, и дизайнера, и верстальщика. И капиталовложения.</p>
				<h2>Какие бывают cms</h2>
					<p>Бывают различные системы управления контентом: для интернет-магазинов, для блогов, для форумов и т.д.</p>
				<h2>Примеры cms</h2>
					<p><i>Примеры популярных CMS: </i> Joomla, WordPress (для блогов), PhpBB (для форумов).</p>
					<p><b>CMS-ки</b> бывают <i>платные</i> и <i>бесплатные</i>.</p>



	<h2>3. На списки. Повторите страницу по данному образцу: </h2>
		<img src="http://localhost/img/example2.jpg">
		<p>Решение:</p>
		<h1>Списки</h1>
			<h2>Cписки цветов</h2>
				<ul>
					<li>Красный</li>
					<li>Желтый</li>
					<li>Зеленый</li>
					<li>Синий</li>
				</ul>
			<h2>Список студентов</h2>
				<ol>
					<li>Иванов</li>
					<li>Петров</li>
					<li>Сидоров</li>
					<li>Николаев</li>
				</ol>
			<h2>Список студентов</h2>
				<ol>
					<li>Иванов</li>
						<ul>
							<li>Возраст - 23 года</li>
							<li>Курс - 3</li>
						</ul>
					<li>Петров</li>
						<ul>
							<li>Возраст - 19 лет</li>
							<li>Курс - 2</li>
						</ul>
					<li>Сидоров</li>
						<ul>
							<li>Возраст - 18 лет</li>
							<li>Курс - 1</li>
						</ul>
				</ol>



	<h2>4. На заголовки, абзацы, и списки</h2>
		<img src="http://localhost/img/example3.jpg">
		<p>Решение: </p>
		<h1>Что нужно знать, чтобы делать сайты</h1>
			<ol>
				<li><b>HTML</b></li>
				<li><i>CSS</i></li>
				<li>PHP</li>
				<li>SQL</li>
				<li>JavaScript</li>
				<li>jQuery</li>
				<li>Flash</li>
				<li>SEO</li>
			</ol>
			<h2>PHP и JavaScript</h2>
				<p>Языки программирования <b>PHP</b> и <b>JavaScript</b> позволяют сделать 		динамичными, то есть реагирующими на дейстивия пользователя. Например, 		можно сделать красивую выпадающую менюшку или слайдер.</p>
			<h2>Виды скриптов</h2>
				<p>	Для этого пишутся скрипты (англ. <i>script</i> - &laquoсценарий&raquo) 		- программы, позволяющиее реагировать на действия пользователя. Скрипты 	бывают двух видов:
					<ul>
						<li>
							Те, которые выполняются на сервере, а результат их выполнения приходит в бразуер к пользователю уже в готовом виде. Это скрипты, написанные на языке <b>PHP</b>. На нем пишутся <b>CMS-ки</b> - системы управления контентом.
						</li>
						<li>
							Те, которые выполняются прямо в браузере пользователя. Это скрипты, написанные на языке <b>JavaScript</b>. Они чаще всего используется для, того чтобы сделать страницу более удобной и красивой,
						</li>
					</ul>
				</p>



	<h2>5. Связанные ссылками страницы </h2>
		<p>
			<a href="http://localhost/practice1.php">Страница этой практики</a> ,
			<a href="http://localhost/theory1.php">Страница теории</a> ,
			<a href="http://localhost/HelloWorld.php">Страница Helloworlda</a>.
		</p>



	<h2>6. Картинки</h2>
	<img src="http://localhost/img/smile1.png">

	<br><p>
			<a href="http://localhost/practice2.php"><b>Страница практики 2<b></a>,
			<a href="http://localhost/theory2.php"><b>Страница теории 2<b></a>

		</p>


</body>
</html>