<!DOCTYPE html>
<html>



<head>
	<meta charset="utf-8">
	<title>Здесь рассказывается о CMS</title>
	<link rel="stylesheet" type="text/css" href="http://localhost/styles_css/style_practice6.1.css">
</head>



<body>
	<img src="http://localhost/img/example6.1.1.jpg">
	<p>Решение: </p>

	<h1>Что такое CMS</h1>
			<p><b>CMS</b> - &laquoсистема управления контентом&raquo (движок) &ndash 
			 написанная PHP-программистами основа для сайта, с помощью которой вы сможете
			управлять сайтом (добавлять контент, менять пунткы меню и т.п.) не зная HTML и CSS.
			</p>
			<p>Однако ля того чтобы сделать сайт с помощью <b>CMS</b> <i>потребуются услуги</i> и программиста, и дизайнера и верстальщика. И капиталовложения.</p>
		
		<h2>Какие бывают cms</h2>
			<p>Бывают различные системы управления контентом:
			для интернет-магазинов, для биологов, для форумов и т.д.</p>
		
		<h2>Примеры cms</h2>
			<p><i>Примеры популярных CMS:</i> Joomla, WordPress(для блогов), PhpBB(для форумов).</p>

			<p><b>CMS-ки</b> бывают <i>платные</i> и <i>бесплатные</i></p>
</body>
</html>